# General Utility
brew "asdf"
brew "base64"
brew "cfssl"
brew "direnv"
brew "fping"
brew "gnu-sed"
brew "gnupg"
brew "grep"
brew "graphviz"
brew "gpg"
brew "htop"
brew "httpie"
brew "iftop"
brew "ipcalc"
brew "jq"
brew "jsonnet"
brew "nmap"
brew "mcfly"
brew "mtr"
brew "sipcalc"
brew "socat"
brew "the_silver_searcher"
brew "tmux"
brew "tmux-mem-cpu-load"
brew "tree"
brew "tty-clock"
brew "unzip"
brew "vtclock"
brew "watch"
brew "wget"
brew "yq"

# GitHub
brew "act"
brew "gh"
brew "git"
brew "sops"

cask "sourcetree"

# Kubernetes
tap "derailed/k9s"
tap "hashicorp/tap"
tap "FairwindsOps/tap"

brew "fluxcd/tap/flux"
brew "FairwindsOps/tap/pluto"
brew "FairwindsOps/tap/polaris"
brew "derailed/k9s/k9s"

brew "argocd"
brew "flux"
brew "fluxctl"
brew "glooctl"
brew "helm"
brew "istioctl"
brew "k9s"
brew "kind"
brew "kompose"
brew "kubectl"
brew "kustomize"
brew "kube-linter"
brew "kubeaudit"
brew "kubecfg"
brew "krew"
brew "kubectx"
brew "minikube"

cask "kube-forwarder"

# Hashicorp
tap "hashicorp/tap"

brew "hashicorp/tap/consul"
brew "hashicorp/tap/vault"
brew "hashicorp/tap/waypoint"

brew "atlantis"
brew "packer"
brew "terraform"
brew "terraform-docs"
brew "terragrunt"
brew "tflint"
brew "tfsec"

# AWS
brew "awscli"
brew "awsume"
brew "eksctl"
brew "s3cmd"

cask "aws-vault"

# Programming
brew "goenv"
brew "golang"
brew "k6"
brew "make"
brew "sonar-scanner"
brew "openjdk"
brew "pyenv"
brew "pyenv-virtualenv"

cask "oracle-jdk"
cask "powershell"
cask "visual-studio-code"

# Misc. Casks/Vendor Apps
cask "1password"
cask "1password-cli"
cask "apache-directory-studio"
cask "appcleaner"
cask "bettertouchtool"
cask "caffeine"
cask "docker"
cask "doteditor"
cask "firefox"
cask "google-drive"
cask "google-drive-file-stream"
cask "iterm2"
cask "keybase"
cask "lens"
cask "macfuse"
cask "skitch"
cask "slack"
cask "spectacle"
cask "vagrant"
cask "virtualbox"
cask "vivaldi"
cask "vlc"
cask "the-unarchiver"

# Apple App Store Apps
brew "mas"

mas "EasyRes", id: 688211836
mas "Hour - World Clock", id: 569089415

